{
	"navigation": {
		"home": "Accueil",
		"about": "À propos",
		"kim": "Hanjun Kim",
		"experience": "Expérience",
		"blog": "Blog",
		"project": "Projet",
		"contact": "Contact"
	},
	"home": {
		"techniqueIcon": {
			"title": "Pile technologique"
		},
		"services": {
			"title1": "Expérience de Projets",
			"description1": "J'ai de l'expérience en développement full-stack en utilisant des frameworks Java et React sur divers projets. J'utilise Redux pour la gestion de l'état et Styled-components ainsi que MUI pour le stylisme. Je suis capable de gérer des bases de données SQL et NoSQL, et je travaille également sur des designs avec Figma.",
			"title2": "Dispositifs",
			"description2": "Pour un design réactif en temps réel, j'utilise et gère chaque appareil réel connecté localement par le réseau. C'est une méthode visant à un développement plus rapide.",
			"title3": "Effort",
			"description3": "Je participe à des communautés de développeurs pour m'inspirer de diverses logiques et je développe et teste de nouvelles logiques à travers des recherches, afin d'améliorer mes compétences de développement."
		},
		"about": {
			"title": "Infos",
			"description": "J'ai de l'expérience dans le développement backend en utilisant des frameworks Java et dans le développement frontend avec React et TypeScript. J'utilise Redux.js pour la gestion de l'état et Styled-components ainsi que Material-UI pour le stylisme. Ces diverses expériences m'ont permis d'acquérir des compétences en développement full-stack et d'améliorer mes capacités de gestion de projet et de collaboration d'équipe selon la méthode Agile. Je m'efforce de continuer à grandir et à progresser en tant que développeur."
		},
		"jumbotron": {
			"title": "Bonjour, Je m'appelle",
			"description": "Hanjun Kim,",
			"description1": "Je suis développer Full Stack"
		},
		"blog": {
			"title": "Blog",
			"description": "Découvrez les derniers articles de blog",
			"button": "Tous"
		},
		"contact": {
			"title": "Contactez-moi",
			"cardTitle1": "Email",
			"cardTitle2": "France",
			"cardTitle3": "Bénévolat",
			"description1": "Écrire un e-mail",
			"description2": "Hauts-de-Seine, Île-de-France",
			"description3": "Création de site gratuit"
		}
	},
	"notFound": {
		"title": "404 - Page non trouvée"
	}
}
