{
	"navigation": {
		"home": "Accueil",
		"about": "À propos",
		"kim": "Hanjun Kim",
		"experience": "Expérience",
		"blog": "Blog",
		"project": "Projet",
		"contact": "Contact"
	},
	"about": {
		"job": {
			"title1": "Java",
			"title2": "Salesforce",
			"title3": "React",
			"title4": "OpenClassrooms",
			"content1": "JPA, Spring, Spring Boot, HTTP",
			"content2": "Lightning Web Components (LWC), Apex (Fortement Typé, Java)",
			"content3": "React, TypeScript, Redux, Styled-Components, MUI",
			"content4": "Diplôme de développeur logiciel (niveau 6 bac +3/4) obtenu",
			"content5": "Diplôme de développeur intégrateur web (niveau 5 bac +2) obtenu",
			"detail1": "J'étudie le polymorphisme et les classes en Java, en m'efforçant d'écrire une programmation orientée objet efficace.",
			"detail2": "J'approfondis ma compréhension des langages orientés objet en utilisant Spring et JPA, et je cherche actuellement un contrat d'apprentissage.",
			"detail3": "J'ai développé un projet de CV numérique géré au sein de l'entreprise, et conçu diverses formes (promotion, participants, questionnaire, etc.) ainsi qu'une page de démonstration.",
			"detail4": "J'ai réalisé un développement full-stack en utilisant LWC et APEX, et conçu des interfaces web pour desktop et mobile en utilisant Figma.",
			"detail5": "J'ai participé à un projet de logiciel de gestion de tournage, en prenant en charge la conception mobile de A à Z et le développement de l'interface utilisateur. J'ai également créé une page de démonstration.",
			"detail6": "J'ai réalisé le développement front-end en utilisant React et TypeScript, et conçu des interfaces web pour desktop, tablette et mobile en utilisant Figma.",
			"detail7": "J'ai appris à ajouter des animations en JavaScript et à interfacer avec des API pour traiter des données complexes. J'ai développé des applications web dynamiques avec le framework React et géré l'état avec Redux. En parallèle, j'ai acquis des compétences en développement backend avec Node.js, Express et MongoDB, ainsi qu'en optimisation SEO et en amélioration de l'accessibilité web pour améliorer la performance des sites web."
		},
		"kim": {
			"title1": "Expérience en développement backend",
			"title2": "Expérience en développement frontend",
			"title3": "Méthodologie agile et collaboration en équipe",
			"title4": "Croissance et développement continus",
			"description1": "Actuellement, j'apprends les bases de Java et j'étudie le développement backend en utilisant le framework Java Spring. Après avoir maîtrisé les bases de la syntaxe Java et les concepts de la programmation orientée objet, j'apprends à comprendre les principes fondamentaux et la structure du développement backend à l'aide de frameworks puissants comme Spring Boot.",
			"description2": "Grâce à Spring, j'apprends diverses techniques de développement backend telles que la conception de bases de données, l'implémentation d'API RESTful, et la gestion des authentifications et des autorisations. Au cours de ce processus, je réalise des exercices pratiques pour comprendre comment traiter des logiques métier complexes et construire des serveurs stables et évolutifs. En particulier, j'étudie la conception et l'implémentation de systèmes de gestion des authentifications et des autorisations à l'aide de Spring Security, en apprenant à utiliser OAuth2.0 et les tokens JWT (Json Web Token) pour les solutions de sécurité. De plus, j'acquiers des connaissances sur la modélisation de bases de données et l'optimisation des requêtes avec JPA (Java Persistence API), ainsi que sur les méthodes permettant de réaliser une intégration de base de données performante.",
			"description3": "En développement frontend, j'ai principalement utilisé React et TypeScript. En exploitant l'architecture basée sur les composants de React, j'ai conçu des composants UI réutilisables, et amélioré la lisibilité et la maintenabilité du code grâce à TypeScript. Ces technologies m'ont permis de créer un environnement de travail efficace même pour des projets de grande envergure.",
			"description4": "Pour la gestion d'état, j'ai utilisé Redux.js. Redux permet de gérer l'état de l'application de manière centralisée, ce qui clarifie le flux de données entre les composants et rend la gestion de l'état prédictible. Cela m'a permis de maintenir un état cohérent, de réduire les bugs et de faciliter le débogage, même dans les projets nécessitant une gestion d'état complexe.",
			"description5": "De plus, j'ai utilisé Styled-components et Material-UI pour construire un système de design cohérent. En définissant les styles dans des fichiers JavaScript avec Styled-components, j'ai modulé et augmenté la réutilisabilité du style des composants. Material-UI, une bibliothèque de composants suivant les directives de design de Google Material, a grandement amélioré l'expérience utilisateur. Grâce à ces outils, j'ai pu implémenter une interface utilisateur intuitive et très réactive.",
			"description6": "La gestion de projets et la capacité à collaborer en équipe sont également des compétences dont je suis fier. Grâce à mon expérience en gestion de projets basée sur la méthodologie agile, j'ai pu communiquer et collaborer efficacement avec les membres de l'équipe pour mener les projets à bien. En utilisant la méthode Scrum, j'ai établi des plans de sprint, partagé les progrès de l'équipe lors de réunions quotidiennes, et amélioré les projets en intégrant des retours continus.",
			"description7": "En particulier, j'ai utilisé des outils de collaboration tels que DevOps et Slack pour gérer les calendriers de projet et documenter les processus de manière rigoureuse. Cela a permis à tous les membres de l'équipe de comprendre clairement les objectifs et les progrès du projet, d'assigner des rôles et des responsabilités de manière claire, et de maximiser l'efficacité du travail.",
			"description8": "Je continuerai à m'efforcer de devenir un développeur qui croît et se développe constamment. J'étudierai les dernières tendances technologiques et les nouveaux outils, et les appliquerai en pratique pour proposer de meilleures solutions. En outre, je contribuerai à des projets open source et échangerai avec la communauté des développeurs pour acquérir diverses perspectives et expériences, renforçant ainsi mes compétences techniques.",
			"description9": "Avec cette expérience et cette passion, je m'efforcerai de jouer mon rôle de développeur en offrant des solutions innovantes et de valeur, en répondant de manière flexible à tous les défis. Dans mon parcours futur, je continuerai à croître et à contribuer au succès de l'équipe et de l'organisation."
		}
	},
	"home": {
		"techniqueIcon": {
			"title": "Pile technologique"
		},
		"services": {
			"title1": "Expérience de Projets",
			"description1": "J'ai de l'expérience en développement full-stack en utilisant des frameworks Java et React sur divers projets. J'utilise Redux pour la gestion de l'état et Styled-components ainsi que MUI pour le stylisme. Je suis capable de gérer des bases de données SQL et NoSQL, et je travaille également sur des designs avec Figma.",
			"title2": "Dispositifs",
			"description2": "Pour un design réactif en temps réel, j'utilise et gère chaque appareil réel connecté localement par le réseau. C'est une méthode visant à un développement plus rapide.",
			"title3": "Effort",
			"description3": "Je participe à des communautés de développeurs pour m'inspirer de diverses logiques et je développe et teste de nouvelles logiques à travers des recherches, afin d'améliorer mes compétences de développement."
		},
		"about": {
			"title": "Infos",
			"description": "J'ai de l'expérience dans le développement backend en utilisant des frameworks Java et dans le développement frontend avec React et TypeScript. J'utilise Redux.js pour la gestion de l'état et Styled-components ainsi que Material-UI pour le stylisme. Ces diverses expériences m'ont permis d'acquérir des compétences en développement full-stack et d'améliorer mes capacités de gestion de projet et de collaboration d'équipe selon la méthode Agile. Je m'efforce de continuer à grandir et à progresser en tant que développeur."
		},
		"jumbotron": {
			"title": "Bonjour, Je m'appelle",
			"description": "Hanjun Kim,",
			"description1": "Je suis développer Full Stack"
		},
		"blog": {
			"title": "Blog",
			"description": "Découvrez les derniers articles de blog",
			"button": "Tous"
		},
		"contact": {
			"title": "Contactez-moi",
			"cardTitle1": "Email",
			"cardTitle2": "France",
			"cardTitle3": "Bénévolat",
			"description1": "Écrire un e-mail",
			"description2": "Hauts-de-Seine, Île-de-France",
			"description3": "Création de site gratuit"
		}
	},
	"contact": {
		"title": "Contactez-moi",
		"name": "Nom",
		"nameError": "Le nom est requis",
		"email": "Votre email",
		"emailError": "Un email valide est requis",
		"subject": "Sujet",
		"subjectError": "Le sujet est requis",
		"message": "Message",
		"messageError": "Le message est requis",
		"button": "Envoyer"
	},
	"notFound": {
		"title": "404 - Page non trouvée"
	}
}
